{
    "basic_info": {
      "description_header": "Hey There!",
      "description": "I’m Ian F. Shirley, a software developer & designer with a background in sales, customer service & fraud investigation. I love designing, building, and fixing things, and I'm obsessed with finding answers to the questions “how” and “why”. I’m very analytical, and motivated to find solutions to the problems I encounter, and I disagree with the phrase “if it ain’t broke, don’t try to fix it”, because I think there’s usually a way to improve on something even if it’s already working. In short, I like to find ways to maximize efficiency.  All of these things make this a rewarding career for me;  and on top of that, I hope that someday I can use those skills and attributes at a company that makes positive contributions to issues that I care about, such as homelessness or environmental sustainability.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Target Practice",
        "startDate": "2022",
        "description": "A retro computer game in the style of the Nintendo classic, \"Duck Hunt\". This was my group project in Code 201 at Code Fellows. We created it using HTML, CSS & JavaScript. On the gameplay page, the user attempts to shoot the target using the crosshair cursor while the bird is animated to fly randomly around the gameplay area. We also made use of local storage to be able to save previous players' scores to the leaderboard page. The scoreboard on the gameplay screen updates the current user's score and level in real time.",
        "images": [
          "images/portfolio/target-practice/target-practice-home.png",
          "images/portfolio/target-practice/target-practice.png"
        ],
        "url": "https://cf201-team-black.github.io/target-practice/",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "5 O'Clock Somewhere",
        "startDate": "2022",
        "description": "A project from Code 201 at Code Fellows. A website for a cookie shop, showing hours and addresses for various shop locations, as well as contact information. An additional 'Sales Data' page, where the owner can view cookie sales at each location broken down by the hour and by the day. The 'Sales Data' page also contains a form where the owner can enter sales data for new pop up locations to determine profitability for potential permanent new locations.",
        "images": [
          "images/portfolio/5-o-clock/1024px-Tiki-Cocktails.jpg",
          "images/portfolio/salmon-cookies/salmon-cookies2.png"
        ],
        "url": "https://5-o-clock.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS3"
          }
        ]
      },
      {
        "title": "Stream Stats",
        "startDate": "2023",
        "description": "A Jupyter Notebook that allows users to display their Netflix user data ",
        "images": [
          "images/portfolio/stream-stats/stream-stats.png",
          "images/portfolio/stream-stats/stream-stats2.png"
        ],
        "url": "https://www.kaggle.com/code/keyantabor/stream-stats",
        "technologies": [
          {
            "class": "devicon-python-plain",
            "name": "Python"
          },
          {
            "class": "devicon-jupyter-plain-wordmark",
            "name": "jupyter"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Code Fellows",
        "title": "Software Developer",
        "years": "10.2022 - 2.2023",
        "mainTech": [
          "Python"
        ],
        "technologies": [
          "Python",
          "JavaScript",
          "Bootstrap",
          "React",
          "Node.js",
          "HTML5",
          "CSS3"
        ]
      }
    ]
  }
